Revit 2024 API
IPipePressureDropServer.Calculate Method
 Calculate the pipe pressure drop.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
void Calculate(
	PipePressureDropData data
)
Visual Basic
Sub Calculate ( _
	data As PipePressureDropData _
)
Visual C++
void Calculate(
	PipePressureDropData^ data
)
Parameters
data
Type: Autodesk.Revit.DB.Plumbing.PipePressureDropData
 The input and output data of the calculation.
See Also
IPipePressureDropServer Interface
Autodesk.Revit.DB.Plumbing Namespace